fransstrom/hive-scale/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

#OTA CONFIG
CONFIG_BEESCALE_OTA_URL="https://github.com/fransstrom/hive-scale/releases/latest/download/beescale.bin"

#CYCLE CONFIG
CONFIG_BEESCALE_OTA_CHECK_INTERVAL_WAKEUPS=1
CONFIG_BEESCALE_COMMUNICATION_RETRY_SECONDS=120
CONFIG_BEESCALE_DEEP_SLEEP_SECONDS=300
CONFIG_BEESCALE_MEASUREMENT_QUEUE_CAPACITY=2304

#HX711
CONFIG_GPIO_HX711_DOUT=5
CONFIG_GPIO_HX711_SCK=4
